
{
  "title": "បទពិសោធន៍",
  "subtitle": "ដំណើរវិជ្ជាជីវៈ",
  "timeline": {
    "current": {
      "title": "អ្នកអភិវឌ្ឍន៍ Java និងវិស្វករ DevOps",
      "company": "អគ្គលេខាធិការដ្ឋានគណៈកម្មាធិការរដ្ឋាភិបាលឌីជីថល (DGC)",
      "period": "ខែតុលា ២០២៤ - បច្ចុប្បន្ន",
      "location": "ភ្នំពេញ កម្ពុជា",
      "description": [
        "រចនា អភិវឌ្ឍ និងថែរក្សាកម្មវិធីដែលផ្អែកលើ Java ដោយប្រើប្រាស់ Spring Boot framework",
        "អនុវត្ត និងថែរក្សាដំណោះស្រាយ SSO ដោយប្រើ OAuth2 និង OpenID Connect ជាមួយ Keycloak",
        "សហការជាមួយអ្នកអភិវឌ្ឍន៍ខាងមុខដើម្បីរួមបញ្ចូលធាតុផ្នែកអ្នកប្រើជាមួយ server-side logic",
        "សរសេរកូដដែលបានរចនាយ៉ាងល្អ អាចសាកល្បង និងមានប្រសិទ្ធភាពតាមការអនុវត្តល្អបំផុត",
        "ចូលរួមក្នុងការពិនិត្យកូដដើម្បីធានាគុណភាពកូដ និងការអនុវត្តតាមការអនុវត្តល្អបំផុត",
        "រចនា អនុវត្ត និងថែរក្សា CI/CD pipelines ដោយប្រើ GitHub Actions",
        "តាមដានដំណើរការប្រព័ន្ធ និងដោះស្រាយបញ្ហាដើម្បីធានាភាពអាចប្រើបាន និងភាពទុកចិត្តខ្ពស់",
        "ធ្វើស្វ័យប្រវត្តកម្មការងារដោយដៃដោយប្រើភាសាស្គ្រីប និងឧបករណ៍គ្រប់គ្រងការកំណត់រចនាសម្ព័ន្ធ",
        "ដោះស្រាយបញ្ហា កែកំហុស និងធ្វើឱ្យប្រសើរឡើងនូវដំណើរការកម្មវិធី",
        "ធ្វើបច្ចុប្បន្នភាពជាមួយនឹងនិន្នាការឧស្សាហកម្ម និងបច្ចេកវិទ្យាចុងក្រោយបំផុត"
      ]
    },
    "job1": {
      "title": "កម្មសិក្សាការីអភិវឌ្ឍន៍សូហ្វវែរ និង DevOps",
      "company": "ក្រសួងសេដ្ឋកិច្ចនិងហិរញ្ញវត្ថុ",
      "period": "ខែកុម្ភៈ ២០២៤ - ខែកក្កដា ២០២៤",
      "location": "ភ្នំពេញ កម្ពុជា",
      "description": [
        "រួមចំណែកក្នុងគំនិតផ្តួចផ្តើម DevOps និង SSO ខាងក្នុង",
        "គ្រប់គ្រង Dockerized deployment pipelines និងដំណើរការ deployment ស្វ័យប្រវត្តិ",
        "កំណត់រចនាសម្ព័ន្ធម៉ាស៊ីនបម្រើ NGINX និងធានាសុវត្ថិភាពគេហទំព័រជាមួយ SSL certificates",
        "រួមបញ្ចូលការជូនដំណឹង Telegram ទៅក្នុង Jenkins CI/CD pipeline សម្រាប់ការតាមដាន",
        "ជួយក្នុងការ deploy និងថែរក្សាសេវាកម្ម Java ក្នុងបរិស្ថានផលិតកម្ម",
        "កំណត់ឈ្មោះដូមេនសម្រាប់គម្រោងប្រព័ន្ធ និងគ្រប់គ្រងហេដ្ឋារចនាសម្ព័ន្ធបង្ហោះ"
      ]
    },
    "job2": {
      "title": "កម្មសិក្សាការីអភិវឌ្ឍន៍វែបសាយ",
      "company": "វិទ្យាស្ថានបច្ចេកវិទ្យាកម្ពុជា (ITC)",
      "period": "ខែកក្កដា ២០២៣ - ខែតុលា ២០២៣",
      "location": "ភ្នំពេញ កម្ពុជា",
      "description": [
        "អភិវឌ្ឍគម្រោងសាកលវិទ្យាល័យ full-stack ដោយប្រើ MERN stack (MongoDB, Express, React, Node.js)",
        "រួមបញ្ចូលមុខងារស្កេន QR code សម្រាប់កម្មវិធីទូរស័ព្ទចល័ត",
        "ប្រើ Postman សម្រាប់ការសាកល្បង API កែកំហុស និងឯកសារ",
        "អនុវត្តការរួមបញ្ចូល frontend/backend និងការគ្រប់គ្រងលំហូរទិន្នន័យ",
        "ទទួលបានបទពិសោធន៍ជាក់ស្តែងក្នុងលំហូរការងារអភិវឌ្ឍន៍ full-stack"
      ]
    },
    "job3": {
      "title": "អ្នកបណ្តុះបណ្តាល DevOps",
      "company": "Camcyber Digital",
      "period": "ខែកុម្ភៈ ២០២៣ - ខែឧសភា ២០២៣",
      "location": "ភ្នំពេញ កម្ពុជា",
      "description": [
        "អនុវត្ត Linux CLI និងមូលដ្ឋានគ្រឹះការកំណត់រចនាសម្ព័ន្ធម៉ាស៊ីនបម្រើ",
        "ប្រើ Ansible សម្រាប់ការផ្តល់ជូន និងការគ្រប់គ្រងការកំណត់រចនាសម្ព័ន្ធស្វ័យប្រវត្តិ",
        "រៀបចំផ្ទាំងតាមដានដោយប្រើ Grafana, Prometheus, និង Loki",
        "បង្កើតមូលដ្ឋានក្នុងការតាមដានប្រព័ន្ធ ស្វ័យប្រវត្តកម្ម និងការអនុវត្ត DevOps សម័យទំនើប",
        "រៀន Docker containerization និងការកំណត់រចនាសម្ព័ន្ធ Nginx reverse proxy"
      ]
    }
  }
}
