
{
  "title": "បទពិសោធន៍",
  "subtitle": "ដំណើរវិជ្ជាជីវៈ",
  "timeline": {
    "current": {
      "title": "អ្នកអភិវឌ្ឍន៍វែបសាយ Full-stack",
      "company": "គណៈកម្មាធិការរដ្ឋាភិបាលឌីជីថល (DGC)",
      "period": "ខែតុលា ២០២៤ - បច្ចុប្បន្ន",
      "location": "ភ្នំពេញ កម្ពុជា",
      "description": [
        "រចនា និងថែរក្សាកម្មវិធីដែលផ្អែកលើ Java ដោយប្រើប្រាស់ Spring Boot framework",
        "អនុវត្តការរួមបញ្ចូល Single Sign-On (SSO) ដោយប្រើ OAuth2 និង OpenID Connect ជាមួយ Keycloak",
        "សហការជាមួយក្រុមអ្នកអភិវឌ្ឍន៍ផ្នែកខាងមុខដើម្បីរួមបញ្ចូល server-side logic និងធានាបទពិសោធន៍អ្នកប្រើប្រាស់ដែលរលូន",
        "សរសេរកូដដែលស្អាត អាចថែទាំបាន និងមានប្រសិទ្ធភាពដោយអនុវត្តតាមការអនុវត្តល្អបំផុត",
        "ធ្វើឱ្យប្រសើរឡើងនូវដំណើរការកម្មវិធី និងដោះស្រាយបញ្ហាស្មុគស្មាញ",
        "តាមដានទាន់សម័យជាមួយនឹងនិន្នាការឧស្សាហកម្ម និងបច្ចេកវិទ្យាថ្មីៗ",
        "ធ្វើការក្រោមការត្រួតពិនិត្យរបស់ក្រសួងប្រៃសណីយ៍និងទូរគមនាគមន៍ (MPTC)"
      ]
    },
    "job1": {
      "title": "កម្មសិក្សាការីអភិវឌ្ឍន៍សូហ្វវែរ និង DevOps",
      "company": "ក្រសួងសេដ្ឋកិច្ចនិងហិរញ្ញវត្ថុ",
      "period": "ខែកុម្ភៈ ២០២៤ - ខែមិថុនា ២០២៤",
      "location": "ភ្នំពេញ កម្ពុជា",
      "description": [
        "រួមចំណែកក្នុងការរួមបញ្ចូល DevOps និងគំនិតផ្តួចផ្តើម SSO",
        "រចនាកម្មវិធីគេហទំព័រដែលបានធ្វើឱ្យប្រសើរឡើងដោយ Keycloak",
        "គ្រប់គ្រងការ deployment ស្វ័យប្រវត្តិ ធ្វើ Dockerized កម្មវិធី ការកំណត់រចនាសម្ព័ន្ធម៉ាស៊ីនបម្រើវិបសាយ និងគេហទំព័រដែលមានសុវត្ថិភាព",
        "កំណត់ឈ្មោះដូមេនសម្រាប់គម្រោងប្រព័ន្ធ និងបង្ហោះទាំងអស់",
        "រៀបចំ Telegram សម្រាប់ការតាមដានការ deployment គម្រោង និងការជូនដំណឹងពី pipeline CI/CD របស់ Jenkins"
      ]
    },
    "job2": {
      "title": "កម្មសិក្សាការីអភិវឌ្ឍន៍វែបសាយ",
      "company": "វិទ្យាស្ថានបច្ចេកវិទ្យាកម្ពុជា",
      "period": "ខែកុម្ភៈ ២០២៣ - ខែឧសភា ២០២៣",
      "location": "ភ្នំពេញ កម្ពុជា",
      "description": [
        "កម្មសិក្សារយៈពេល ២ ខែលើប្រព័ន្ធគ្រប់គ្រងសេវាកម្មដឹកជញ្ជូន",
        "ប្រើ MERN Stack (MongoDB, ReactJS, NodeJS, ExpressJS)",
        "អភិវឌ្ឍកម្មវិធីទូរស័ព្ទចល័តសម្រាប់ស្កេន QR code",
        "រួមបញ្ចូល APIs ដោយប្រើ Postman"
      ]
    },
    "job3": {
      "title": "ការបណ្តុះបណ្តាល DevOps",
      "company": "ក្រសួងសាធារណការ និងដឹកជញ្ជូន",
      "period": "ខែកុម្ភៈ ២០២៤ - ខែមិថុនា ២០២៤",
      "location": "កម្ពុជា",
      "description": [
        "គ្របដណ្តប់លើប្រព័ន្ធប្រតិបត្តិការ Linux, containerization ជាមួយ Docker, reverse proxy ជាមួយ Nginx",
        "Jenkins CI/CD, Ansible, Docker Swarm",
        "ការតាមដានជាមួយ Grafana"
      ]
    }
  }
}
